using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WinPhone
{
    class Quiz
    {
        public string[,] Question1 =   // 문제와 답 2차원 배열 생성
        {
            { "ㅅㅍㄱ" , "선풍기"},
            { "ㅈㅇㄱ", "주인공"},
            { "ㅎㅁ", "희망"},
            { "ㄷㄱㄴㄱ", "동갑내기" },
            { "ㅂㄹㅊㄱ", "벼락치기" }
        };

        public string[,] Hint1 =        // 힌트 2차원 배열 생성
        {
            {"바람", "여름"},
            {"중심인물", "소설의" },
            {"가능성", "꿈"},
            {"친구", "또래" },
            {"날림", "서둘러" }
        };

        public string[,] Question2 =   // 문제와 답 2차원 배열 생성
        {
            { "ㅇㄷㅇ" , "열대야"},
            { "ㅂㅁㄹ", "부메랑"},
            { "ㄱㄱㄷ", "구구단"},
            { "ㅂㅇㅆㄱ", "받아쓰기" },
            { "ㅂㄷ", "변덕" }
        };

        public string[,] Hint2 =        // 힌트 2차원 배열 생성
        {
            {"밤", "무더위"},
            {"돌아오다", "무기" },
            {"곱셈", "외우다"},
            {"글씨", "그대로" },
            {"변화무쌍", "날씨" }
        };

        public string[,] Question3 =   // 문제와 답 2차원 배열 생성
        {
            { "ㅅㅁ" , "신문"},
            { "ㄱㄷㄹㅇ", "겨드랑이"},
            { "ㅈㅇ", "조언"},
            { "ㅈㄱㅅㄱ", "자기소개" },
            { "ㄱㅇㅂㅇㅂ", "가위바위보" }
        };

        public string[,] Hint3 =        // 힌트 2차원 배열 생성
        {
            {"새소식", "간행물"},
            {"팔", "오목한" },
            {"도움말", "멘토"},
            {"첫만남", "이름" },
            {"승부", "손모양" }
        };

        public string[,] Question4 =   // 문제와 답 2차원 배열 생성
        {
            { "ㅈㅈㄱ" , "정전기"},
            { "ㅈㄴ", "장난"},
            { "ㅈㅅㄹ", "잔소리"},
            { "ㅈㅅㄱ", "전성기" },
            { "ㅁㅂㄱ", "맛보기" }
        };

        public string[,] Hint4 =        // 힌트 2차원 배열 생성
        {
            {"찌릿 찌릿", "스웨터"},
            {"어린아이", "심심풀이" },
            {"꾸지람", "자질구레한"},
            {"한창", "정점" },
            {"시험 삼아", "조금" }
        };

        public string[,] Question5 =   // 문제와 답 2차원 배열 생성
        {
            { "ㄴㅍㅂㅈ" , "나팔바지"},
            { "ㄷㄷㅇ", "됨됨이"},
            { "ㅂㄹㅅㅈ", "벼룩시장"},
            { "ㅂㅈㅇ", "부작용" },
            { "ㅌㄱㅇㄹ", "탐관오리" }
        };

        public string[,] Hint5 =        // 힌트 2차원 배열 생성
        {
            {"넓어지다", "패션"},
            {"성품", "인격" },
            {"값싼", "중고품"},
            {"부수적인", "약효과" },
            {"벼슬아치", "부정부패" }
        };
    }
}
